BOT_TOKEN = '6614044041:AAGvDhNFKaUqoDpYpnBqhSV-GEvZ8BtMmSc'

ADMIN_IDS = [155840708]

MONGO_STRING = 'mongodb+srv://tsbgalcontract:mymongodb26@cluster0.kppkt.mongodb.net/test?authSource=admin&replicaSet=atlas-8jvx35-shard-0&readPreference=primary&appname=MongoDB%20Compass&ssl=true'

about_text = ('Вітаємо! 7 років поспіль компанія Resident Development демонструє динамічний розвиток та активну соціальну позицію на ринку Львова. Сучасні підходи в проектуванні та нові технології дозволяють зберегти індивідуальні історичні особливості й при цьому надати нового життя районам міста.\n'
              'Головне в нашому будівництві — ідея комфортного житла.\n'
              'Наші житлові комплекси - це простір, де кожен створює свої життєві історії.\n'
              'Наша роль — подарувати ключі від цієї нової сторінки життя і непомітно залишатись поруч.')

zk_info = {'n69-residents': {'details': 'Комплекс облаштований різним типом планувань помешкань - від компактних смартів до преміальних пентхаусів з просторими терасами!\n\n'
                                        'Комплекс має закриту територію, яка знаходиться під охороною від нашого партнера *«Спарта-Захід»*.\n'
                                        'Також, наявний підземний дворівневий паркінг з автоматичним доступом.',
                             'infrastructure': 'Неподалік знаходяться два парки: Снопківський та парк «Залізна вода», які обладнані для комфортних прогулянок та занять спортом.\n'
                                               "Також, в радіусі 1 км знаходяться навчальні заклади - школа-садок «Софія», Креативна міжнародна школа, де дітки зможуть здобувати якісну освіту за інноваційними методиками навчання! Неподалік розташовані лікарні та медичні центри: лікарня №8, дитячий центр здоров'я ім. Анни Мазуренко, клініки «Ехокор» і «Миру Мед»."},
           'Lennona-residents': {'details': 'Облаштований комплекс закритою територією, яка знаходиться під охороною від нашого партнера *«Спарта-Захід»*.\n'
                                            'Також, наявний гостьовий та підземний дворівневий паркінги для вашого комфорту! ',
                                 'infrastructure': 'Інфраструктура навколо житлового комплексу розміщена в радіусі до одного кілометру: продуктові магазини, лікарня Святого Пантелеймона, навчальні заклади для малечі, торговий центр і тд'},
           'five-address': {'details': 'Комплекс має закриту територію, яка знаходиться під охороною від нашого партнера *«Спарта-Захід»*.\n'
                                       'Також, наявний підземний та гостьовий паркінг.',
                            'infrastructure': 'На відстані до 1 км знаходиться необхідний благоустрій для забезпечення комфортного життя! Супермаркети, аптеки, лікарня, розважальні комплекси для малечі в пішій доступності дозволять зберегти час на те, що ви любите!'},
           'holoskoresidents': {'details': 'Велика кількість квартир облаштовані терасами з видом на парк або сквер, що дозволить мешканцям насолоджуватися чудовими панорамами та свіжим повітрям. Також, розташування квартир забезпечує мальовничий вид та максимальний доступ до зеленої зони навколо комплексу.\n'
                                           'Комплекс має закриту територію, яка знаходиться під охороною від нашого партнера *«Спарта-Захід»*.\n'
                                           'Також, наявний підземний дворівневий та гостьовий паркінг.',
                                'infrastructure': 'На відстані до 1 км знаходиться необхідний устрій для забезпечення комфортного життя наших резидентів!\n'
                                                  'Супермаркети, аптеки, лікарня, навчальні заклади для малечі в пішій доступності дозволять зберегти час на те, що ви любите!'},
           'novo': {'details': 'Даний комплекс позиціонується як SMART LIFE, доступне житло зі зручною комунікацією з містом.\n'
                               'Комплекс має закриту територію, яка знаходиться під охороною від нашого партнера «Спарта-Захід».\n'
                               'Також, наявний підземний та гостьовий паркінг.',
                    'infrastructure': 'На відстані до 1 км знаходиться необхідний устрій для забезпечення комфортного життя наших резидентів! Супермаркети, спортивний зал, парк, заклади харчування, навчальні заклади для малечі в пішій доступності дозволять зберегти час на те, що ви любите!'},
           'zk-resident-hall': {'details': 'Житловий комплекс пропонує комфортне життя - ідеальним вибір для тих, хто цінує зручність і якість. Затишні квартири з сучасним дизайном та функціональним плануванням створюють домашню атмосферу. Також, наявний окремостоячий та гостьовий паркінг.',
                                'infrastructure': "Транспортна розв'язка — вулиця Городоцька, по якій в будній день до центру Львова їхати 20-25 хвилин. Через дорогу від Resident Hall зупинки громадського транспорту.\n"
                                                  "До найближчих супермаркетів їхати кілька хвилин на авто: «Арсен»,«Рукавичка», «Сільпо» та інші. В окрузі відкрито кілька кав'ярень, кафе та піцерія."},
           'r2-residence': {'details': 'ЖК ''R2 Residence'' унікальний мікрорайон, який втілює відчуття гармонії, спокою та екологічності.\n'
                                       'Сучасний погляд на простір зовні будинку виділяється оригінальними архітектурними формами з повною відсутністю гострих кутів.\n'
                                       'Також, наявні гостьовий паркінг та закрита від автомобілів територія.',
                            'infrastructure': 'За кілька хвилин пішки від новобудови знаходиться зупинка громадського транспорту на вулиці Суботівській, від якої до різних мікрорайонів міста прямують автобуси. Автомобілем до площі Ринок  — 20 хвилин. \n'
                                              "У пішому доступі від ЖК всі основні інфраструктурні об'єкти: школи, дитячі садки, магазини, медичні та спортивні центри. До найближчого супермаркету «Близенько» — 3 хвилини пішки, у радіусі 15 хвилин розташовані супермаркети Vopak, «Сільпо», «АТБ-Маркет» та кілька невеликих продуктових магазинів."},
           'zk-sadova-resident': {'details': "Житловий комплекс Sadova Resident — це новобудова у стилі «місто в місті» з власним центром дитячого розвитку, ігровими майданчиками, зонами для відпочинку. Перші поверхи будинку відведені під комерційні приміщення: магазини, банки, аптеки та інші соціальні об'єкти.\n"
                                             "Також, наявний підземний з ліфтом та гостьовий паркінг.",
                                  'infrastructure': "Завдяки зручному розташуванню комплексу, власники квартир зможуть швидко добиратися в будь-які куточки Львова: у 6 хвилинах від будинку зупинка міського транспорту, а у 3 хвилинах на авто велика транспортна розв'язка та одна з магістралей міста — вулиця Кульпарківська.\n"
                                                    "Купувати продукти жителі «Sadova Resident» зможуть в продуктовому супермаркеті, розташованому на першому поверсі будинку, а також в магазинах великих торгових мереж по сусідству: «Новий»,«АТБ», «Вопак», «Ашан»."}}
